In [3]:
import pandas as pd
import numpy as np

oggetto = {
    'nomi': [
        'Davide', 'Alessia', 'Chiara', 'Matteo', 'Pippo', 'Coca', 'Giulia', 'Luca', 'Marco', 'Sara',
        'Francesca', 'Andrea', 'Martina', 'Federico', 'Elena', 'Giorgio', 'Valentina', 'Simone', 'Ilaria', 'Riccardo',
        'Aurora', 'Nicola', 'Beatrice', 'Tommaso', 'Camilla', 'Gabriele', 'Noemi', 'Stefano', 'Alice', 'Michele',
        'Laura', 'Emanuele', 'Sofia', 'Pietro', 'Claudia', 'Franco', 'Paola', 'Filippo', 'Caterina', 'Daniele',
        'Silvia', 'Luigi', 'Roberta', 'Giacomo', 'Serena', 'Antonio', 'Cristina', 'Enrico', 'Anna', 'Giovanni',
        'Lucia', 'Massimo', 'Veronica', 'Fabio', 'Marta', 'Lorenzo', 'Eleonora', 'Vincenzo', 'Diana', 'Roberto',
        'Simona', 'Salvatore', 'Angela', 'Giuseppe', 'Vittoria', 'Claudio', 'Elisabetta', 'Dario', 'Manuela', 'Paolo',
        'Tiziana', 'Alberto', 'Barbara', 'Umberto', 'Monica', 'Renato', 'Sabrina', 'Carlo', 'Daniela', 'Edoardo',
        'Federica', 'Valerio', 'Patrizia', 'Gianluca', 'Cinzia', 'Maurizio', 'Alessandra', 'Sandro', 'Rita', 'Guido',
        'Marina', 'Raffaele', 'Antonella', 'Mario', 'Ginevra', 'Aldo', 'Livia', 'Bruno', 'Rossella', 'Vasco'
    ],
    'età': [
        23, 22, 25, np.nan, 9, 65, 34, 45, 29, 31,
        18, 52, 27, 40, 33, np.nan, 28, 36, 24, 41,
        19, 55, 30, 12, 26, 38, 22, 47, 35, 60,
        29, 32, 21, 58, 44, 70, 50, 23, 39, 42,
        31, np.nan, 37, 25, 33, 53, 28, 46, 62, 15,
        24, 48, 29, 35, 27, 20, 32, 59, 26, 43,
        30, 68, 41, 56, 25, 49, 34, 31, 28, 51,
        42, 36, 45, 63, 38, 54, 32, 72, 47, 21,
        29, 33, 50, 40, 37, 57, 44, 66, 52, 26,
        np.nan, 35, 48, 30, 22, 61, 24, 55, 39, 75
    ],
    'stato_matrimoniale': [
        'sposato', 'sposato', 'fidanzato', 'fidanzato', 'single', 'single', 'sposato', 'divorziato', 'single', 'fidanzato',
        'single', 'sposato', 'fidanzato', 'sposato', 'single', 'sposato', 'fidanzato', 'sposato', 'single', 'divorziato',
        'single', 'sposato', 'fidanzato', 'single', 'single', 'sposato', 'fidanzato', 'divorziato', 'sposato', 'vedovo',
        'single', 'fidanzato', 'single', 'sposato', 'divorziato', 'vedovo', 'sposato', 'single', 'sposato', 'sposato',
        'fidanzato', 'single', 'sposato', 'single', 'fidanzato', 'divorziato', 'single', 'sposato', 'vedovo', 'single',
        'fidanzato', 'sposato', 'single', 'sposato', 'fidanzato', 'single', 'fidanzato', 'divorziato', 'single', 'sposato',
        'single', 'vedovo', 'sposato', 'sposato', 'fidanzato', 'divorziato', 'single', 'single', 'fidanzato', 'sposato',
        'sposato', 'single', 'divorziato', 'vedovo', 'sposato', 'sposato', 'single', 'vedovo', 'divorziato', 'single',
        'fidanzato', 'single', 'sposato', 'sposato', 'divorziato', 'sposato', 'sposato', 'vedovo', 'divorziato', 'single',
        'fidanzato', 'single', 'sposato', 'fidanzato', 'single', 'vedovo', 'single', 'divorziato', 'sposato', 'vedovo'
    ]
}

df = pd.DataFrame(oggetto)

In [4]:
df.head()

      nomi   età stato_matrimoniale
0   Davide  23.0            sposato
1  Alessia  22.0            sposato
2   Chiara  25.0          fidanzato
3   Matteo   NaN          fidanzato
4    Pippo   9.0             single

In [5]:
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 3 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   nomi                100 non-null    str
 1   età                 96 non-null     float64
 2   stato_matrimoniale  100 non-null    str
dtypes: float64(1), str(2)
memory usage: 2.5 KB

In [6]:
df.dtypes

nomi                      str
età                   float64
stato_matrimoniale        str
dtype: object

In [7]:
df['età'] = df['età'].fillna(0)

In [8]:
df

        nomi   età stato_matrimoniale
0     Davide  23.0            sposato
1    Alessia  22.0            sposato
2     Chiara  25.0          fidanzato
3     Matteo   0.0          fidanzato
4      Pippo   9.0             single
..       ...   ...                ...
95      Aldo  61.0             vedovo
96     Livia  24.0             single
97     Bruno  55.0         divorziato
98  Rossella  39.0            sposato
99     Vasco  75.0             vedovo

[100 rows x 3 columns]

In [9]:
df['età'].mean()

np.float64(36.93)

In [10]:
df['età'].median()

np.float64(35.0)

In [11]:
cat_sorted = sorted(df['stato_matrimoniale'].unique())
cat_map = {val: idx for idx, val in enumerate(cat_sorted)}

df['code_matrimoniale'] = df['stato_matrimoniale'].map(cat_map)

In [12]:
df = pd.get_dummies(df, columns=['stato_matrimoniale'])

In [13]:
df

,nomi,età,code_matrimoniale,stato_matrimoniale_divorziato,stato_matrimoniale_fidanzato,stato_matrimoniale_single,stato_matrimoniale_sposato,stato_matrimoniale_vedovo
0,Davide,23.0,3,False,False,False,True,False
1,Alessia,22.0,3,False,False,False,True,False
2,Chiara,25.0,1,False,True,False,False,False
3,Matteo,0.0,1,False,True,False,False,False
4,Pippo,9.0,2,False,False,True,False,False
...,...,...,...,...,...,...,...,...
95,Aldo,61.0,4,False,False,False,False,True
96,Livia,24.0,2,False,False,True,False,False
97,Bruno,55.0,0,True,False,False,False,False
98,Rossella,39.0,3,False,False,False,True,False
99,Vasco,75.0,4,False,False,False,False,True

In [14]:
df_grouped = df.groupby(['età', 'code_matrimoniale']).agg(
    n_persone=('nomi', 'count')
).reset_index()

df_grouped

     età  code_matrimoniale  n_persone
0    0.0                  1          2
1    0.0                  2          1
2    0.0                  3          1
3    9.0                  2          1
4   12.0                  2          1
..   ...                ...        ...
72  66.0                  4          1
73  68.0                  4          1
74  70.0                  4          1
75  72.0                  4          1
76  75.0                  4          1

[77 rows x 3 columns]

In [15]:
df_pivot = df_grouped.pivot(
    index='età', 
    columns='code_matrimoniale', 
    values='n_persone'
)
df_pivot = df_pivot.fillna(0).astype(int)
df_pivot

code_matrimoniale  0  1  2  3  4
età
0.0                0  2  1  1  0
9.0                0  0  1  0  0
12.0               0  0  1  0  0
15.0               0  0  1  0  0
18.0               0  0  1  0  0
19.0               0  0  1  0  0
20.0               0  0  1  0  0
21.0               0  0  2  0  0
22.0               0  1  1  1  0
23.0               0  0  1  1  0
24.0               0  1  2  0  0
25.0               0  2  1  0  0
26.0               0  0  3  0  0
27.0               0  2  0  0  0
28.0               0  2  1  0  0
29.0               0  1  3  0  0
30.0               0  2  1  0  0
31.0               0  2  1  0  0
32.0               0  2  1  0  0
33.0               0  1  2  0  0
34.0               0  0  1  1  0
35.0               0  0  1  2  0
36.0               0  0  1  1  0
37.0               1  0  0  1  0
38.0               0  0  0  2  0
39.0               0  0  0  2  0
40.0               0  0  0  2  0
41.0               1  0  0  1  0
42.0               0  0  0  2  0
43.0               0  0  0  1  0
44.0               1  0  0  1  0
45.0               2  0  0  0  0
46.0               0  0  0  1  0
47.0               2  0  0  0  0
48.0               0  0  0  2  0
49.0               1  0  0  0  0
50.0               0  0  0  2  0
51.0               0  0  0  1  0
52.0               1  0  0  1  0
53.0               1  0  0  0  0
54.0               0  0  0  1  0
55.0               1  0  0  1  0
56.0               0  0  0  1  0
57.0               0  0  0  1  0
58.0               0  0  0  1  0
59.0               1  0  0  0  0
60.0               0  0  0  0  1
61.0               0  0  0  0  1
62.0               0  0  0  0  1
63.0               0  0  0  0  1
65.0               0  0  1  0  0
66.0               0  0  0  0  1
68.0               0  0  0  0  1
70.0               0  0  0  0  1
72.0               0  0  0  0  1
75.0               0  0  0  0  1